Revit 2024 API
ParameterTypeId.HighestAssociatedLevel Property
 "Highest Associated Level": The highest level associated with this Analytical Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId HighestAssociatedLevel { get; }
Visual Basic
Public Shared ReadOnly Property HighestAssociatedLevel As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ HighestAssociatedLevel {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace